name: "normalize"
layer{
  name:"data"
  type:"Input"
  top:"data"
  input_param {
    shape: { dim: 1 dim: 1 dim: 1080 dim: 1920 }
  }
}

layer {
  name: "normalize"
  type: "Power"
  top: "normalize"
  bottom: "data"
  power_param {
    shift: -0.5
    scale: 0.00392              # 1/255
  }
}
